GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/RCC/Inc/rcc_ll.h
/**
 * @brief	Sets PLL HSE Divider Field
 * @details
 * Programs the `PLLXTPRE` field in `RCC_CFGR` using the supplied raw
 * hardware field value.
 * @param[in] pllHseDividerField	Raw hardware field value for `RCC_CFGR_PLLXTPRE`
 * @returns	@ref driver_status_t Status of PLL HSE divider field update
 * @retval	`DRIVER_STATUS_SUCCESS`: PLL HSE divider field updated successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `pllHseDividerField` is invalid
 */
driver_status_t LL_RCC_SetPLLHSEDivider(const uint32_t pllHseDividerField);

/**
 * @brief	Gets PLL HSE Divider Field
 * @details
 * Reads the `PLLXTPRE` field from `RCC_CFGR` and stores the raw hardware
 * field value in the supplied output pointer.
 * @param[out] pPllHseDividerField	Pointer to destination variable for `RCC_CFGR_PLLXTPRE` field value
 * @returns	@ref driver_status_t Status of PLL HSE divider field read
 * @retval	`DRIVER_STATUS_SUCCESS`: PLL HSE divider field read successfully
 * @retval	`DRIVER_STATUS_ERROR_NULL_PTR`: `pPllHseDividerField` is `NULL`
 */
driver_status_t LL_RCC_GetPLLHSEDivider(uint32_t* const pPllHseDividerField);

/**
 * @brief	Sets PLL Multiplier Field
 * @details
 * Programs the `PLLMUL` field in `RCC_CFGR` using the supplied raw
 * hardware field value.
 * @param[in] pllMulField	Raw hardware field value for `RCC_CFGR_PLLMUL`
 * @returns	@ref driver_status_t Status of PLL multiplier field update
 * @retval	`DRIVER_STATUS_SUCCESS`: PLL multiplier field updated successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `pllMulField` is invalid
 */
driver_status_t LL_RCC_SetPLLMultiplier(const uint32_t pllMulField);

/**
 * @brief	Gets PLL Multiplier Field
 * @details
 * Reads the `PLLMUL` field from `RCC_CFGR` and stores the raw hardware
 * field value in the supplied output pointer.
 * @param[out] pPllMulField	Pointer to destination variable for `RCC_CFGR_PLLMUL` field value
 * @returns	@ref driver_status_t Status of PLL multiplier field read
 * @retval	`DRIVER_STATUS_SUCCESS`: PLL multiplier field read successfully
 * @retval	`DRIVER_STATUS_ERROR_NULL_PTR`: `pPllMulField` is `NULL`
 */
driver_status_t LL_RCC_GetPLLMultiplier(uint32_t* const pPllMulField);

/** @} */ // RCC_02_LL_03_SystemClock

// ==================================================================================================== //
//                                        RCC LL Prescaler APIs                                         //
// ==================================================================================================== //

/**
 * @brief	RCC LL Prescaler Control
 * @defgroup RCC_02_LL_04_Prescalers RCC LL Prescaler Control
 * @ingroup	RCC_02_LL
 * @details
 * This group owns register-near programming of AHB, APB, ADC, and USB prescaler
 * fields using raw hardware encodings from @ref stm32f1xx_rcc.h.
 * @{
 */

/**
 * @brief	Sets AHB Prescaler Field
 * @details Programs the `HPRE` field in `RCC_CFGR`.
 * @param[in] ahbPrescalerField	Raw hardware field value for `RCC_CFGR_HPRE`
 * @returns	@ref driver_status_t Status of AHB prescaler field update
 * @retval	`DRIVER_STATUS_SUCCESS`: AHB prescaler field updated successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `ahbPrescalerField` is invalid
 */
driver_status_t LL_RCC_SetAHBPrescaler(const uint32_t ahbPrescalerField);

/**
 * @brief	Gets AHB Prescaler Field
 * @details Reads the `HPRE` field from `RCC_CFGR`.
 * @param[out] pAhbPrescalerField	Pointer to destination variable for `RCC_CFGR_HPRE` field value
 * @returns	@ref driver_status_t Status of AHB prescaler field read
 * @retval	`DRIVER_STATUS_SUCCESS`: AHB prescaler field read successfully
 * @retval	`DRIVER_STATUS_ERROR_NULL_PTR`: `pAhbPrescalerField` is `NULL`
 */
driver_status_t LL_RCC_GetAHBPrescaler(uint32_t* const pAhbPrescalerField);

/**
 * @brief	Sets APB1 Prescaler Field
 * @details Programs the `PPRE1` field in `RCC_CFGR`.
 * @param[in] apb1PrescalerField	Raw hardware field value for `RCC_CFGR_PPRE1`
 * @returns	@ref driver_status_t Status of APB1 prescaler field update
 * @retval	`DRIVER_STATUS_SUCCESS`: APB1 prescaler field updated successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `apb1PrescalerField` is invalid
 */
driver_status_t LL_RCC_SetAPB1Prescaler(const uint32_t apb1PrescalerField);

/**
 * @brief	Gets APB1 Prescaler Field
 * @details Reads the `PPRE1` field from `RCC_CFGR`.
 * @param[out] pApb1PrescalerField	Pointer to destination variable for `RCC_CFGR_PPRE1` field value
 * @returns	@ref driver_status_t Status of APB1 prescaler field read
 * @retval	`DRIVER_STATUS_SUCCESS`: APB1 prescaler field read successfully
 * @retval	`DRIVER_STATUS_ERROR_NULL_PTR`: `pApb1PrescalerField` is `NULL`
 */
driver_status_t LL_RCC_GetAPB1Prescaler(uint32_t* const pApb1PrescalerField);

/**
 * @brief	Sets APB2 Prescaler Field
 * @details Programs the `PPRE2` field in `RCC_CFGR`.
 * @param[in] apb2PrescalerField	Raw hardware field value for `RCC_CFGR_PPRE2`
 * @returns	@ref driver_status_t Status of APB2 prescaler field update
 * @retval	`DRIVER_STATUS_SUCCESS`: APB2 prescaler field updated successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `apb2PrescalerField` is invalid
 */
driver_status_t LL_RCC_SetAPB2Prescaler(const uint32_t apb2PrescalerField);

/**
 * @brief	Gets APB2 Prescaler Field
 * @details Reads the `PPRE2` field from `RCC_CFGR`.
 * @param[out] pApb2PrescalerField	Pointer to destination variable for `RCC_CFGR_PPRE2` field value
 * @returns	@ref driver_status_t Status of APB2 prescaler field read
 * @retval	`DRIVER_STATUS_SUCCESS`: APB2 prescaler field read successfully
 * @retval	`DRIVER_STATUS_ERROR_NULL_PTR`: `pApb2PrescalerField` is `NULL`
 */
driver_status_t LL_RCC_GetAPB2Prescaler(uint32_t* const pApb2PrescalerField);

/**
 * @brief	Sets ADC Prescaler Field
 * @details Programs the `ADCPRE` field in `RCC_CFGR`.
 * @param[in] adcPrescalerField	Raw hardware field value for `RCC_CFGR_ADCPRE`
 * @returns	@ref driver_status_t Status of ADC prescaler field update
 * @retval	`DRIVER_STATUS_SUCCESS`: ADC prescaler field updated successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `adcPrescalerField` is invalid
 */
driver_status_t LL_RCC_SetADCPrescaler(const uint32_t adcPrescalerField);

/**
 * @brief	Gets ADC Prescaler Field
 * @details Reads the `ADCPRE` field from `RCC_CFGR`.
 * @param[out] pAdcPrescalerField	Pointer to destination variable for `RCC_CFGR_ADCPRE` field value
 * @returns	@ref driver_status_t Status of ADC prescaler field read
 * @retval	`DRIVER_STATUS_SUCCESS`: ADC prescaler field read successfully
 * @retval	`DRIVER_STATUS_ERROR_NULL_PTR`: `pAdcPrescalerField` is `NULL`
 */
driver_status_t LL_RCC_GetADCPrescaler(uint32_t* const pAdcPrescalerField);

/**
 * @brief	Sets USB Prescaler Field
 * @details Programs the `USBPRE` field in `RCC_CFGR`.
 * @param[in] usbPrescalerField	Raw hardware field value for `RCC_CFGR_USBPRE`
 * @returns	@ref driver_status_t Status of USB prescaler field update
 * @retval	`DRIVER_STATUS_SUCCESS`: USB prescaler field updated successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `usbPrescalerField` is invalid
 */
driver_status_t LL_RCC_SetUSBPrescaler(const uint32_t usbPrescalerField);

/**
 * @brief	Gets USB Prescaler Field
 * @details Reads the `USBPRE` field from `RCC_CFGR`.
 * @param[out] pUsbPrescalerField	Pointer to destination variable for `RCC_CFGR_USBPRE` field value
 * @returns	@ref driver_status_t Status of USB prescaler field read
 * @retval	`DRIVER_STATUS_SUCCESS`: USB prescaler field read successfully
 * @retval	`DRIVER_STATUS_ERROR_NULL_PTR`: `pUsbPrescalerField` is `NULL`
 */
driver_status_t LL_RCC_GetUSBPrescaler(uint32_t* const pUsbPrescalerField);

/** @} */ // RCC_02_LL_04_Prescalers

// ==================================================================================================== //
//                                     RCC LL Clock Gate and Reset                                      //
// ==================================================================================================== //

/**
 * @brief	RCC LL Clock Gate and Reset Control
 * @defgroup RCC_02_LL_05_ClockReset RCC LL Clock Gate and Reset Control
 * @ingroup	RCC_02_LL
 * @{
 */

/**
 * @brief	Enables AHB Peripheral Clock
 * @details Sets the requested enable bits in `RCC_AHBENR`.
 * @param[in] mask	Raw hardware bit mask for AHB peripheral clock enable
 * @returns	@ref driver_status_t Status of AHB clock enable operation
 * @retval	`DRIVER_STATUS_SUCCESS`: AHB peripheral clock enabled successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_EnableAHBClock(const uint32_t mask);

/**
 * @brief	Disables AHB Peripheral Clock
 * @details Clears the requested enable bits in `RCC_AHBENR`.
 * @param[in] mask	Raw hardware bit mask for AHB peripheral clock disable
 * @returns	@ref driver_status_t Status of AHB clock disable operation
 * @retval	`DRIVER_STATUS_SUCCESS`: AHB peripheral clock disabled successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_DisableAHBClock(const uint32_t mask);

/**
 * @brief	Enables APB2 Peripheral Clock
 * @details Sets the requested enable bits in `RCC_APB2ENR`.
 * @param[in] mask	Raw hardware bit mask for APB2 peripheral clock enable
 * @returns	@ref driver_status_t Status of APB2 clock enable operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB2 peripheral clock enabled successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_EnableAPB2Clock(const uint32_t mask);

/**
 * @brief	Disables APB2 Peripheral Clock
 * @details Clears the requested enable bits in `RCC_APB2ENR`.
 * @param[in] mask	Raw hardware bit mask for APB2 peripheral clock disable
 * @returns	@ref driver_status_t Status of APB2 clock disable operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB2 peripheral clock disabled successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_DisableAPB2Clock(const uint32_t mask);

/**
 * @brief	Enables APB1 Peripheral Clock
 * @details Sets the requested enable bits in `RCC_APB1ENR`.
 * @param[in] mask	Raw hardware bit mask for APB1 peripheral clock enable
 * @returns	@ref driver_status_t Status of APB1 clock enable operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB1 peripheral clock enabled successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_EnableAPB1Clock(const uint32_t mask);

/**
 * @brief	Disables APB1 Peripheral Clock
 * @details Clears the requested enable bits in `RCC_APB1ENR`.
 * @param[in] mask	Raw hardware bit mask for APB1 peripheral clock disable
 * @returns	@ref driver_status_t Status of APB1 clock disable operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB1 peripheral clock disabled successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_DisableAPB1Clock(const uint32_t mask);

/**
 * @brief	Forces APB2 Peripheral Reset
 * @details Sets the requested reset bits in `RCC_APB2RSTR`.
 * @param[in] mask	Raw hardware bit mask for APB2 peripheral reset
 * @returns	@ref driver_status_t Status of APB2 reset force operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB2 reset asserted successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_ForceAPB2Reset(const uint32_t mask);

/**
 * @brief	Releases APB2 Peripheral Reset
 * @details Clears the requested reset bits in `RCC_APB2RSTR`.
 * @param[in] mask	Raw hardware bit mask for APB2 peripheral reset release
 * @returns	@ref driver_status_t Status of APB2 reset release operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB2 reset released successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_ReleaseAPB2Reset(const uint32_t mask);

/**
 * @brief	Forces APB1 Peripheral Reset
 * @details Sets the requested reset bits in `RCC_APB1RSTR`.
 * @param[in] mask	Raw hardware bit mask for APB1 peripheral reset
 * @returns	@ref driver_status_t Status of APB1 reset force operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB1 reset asserted successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_ForceAPB1Reset(const uint32_t mask);

/**
 * @brief	Releases APB1 Peripheral Reset
 * @details Clears the requested reset bits in `RCC_APB1RSTR`.
 * @param[in] mask	Raw hardware bit mask for APB1 peripheral reset release
 * @returns	@ref driver_status_t Status of APB1 reset release operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB1 reset released successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_ReleaseAPB1Reset(const uint32_t mask);

/**
 * @brief	Pulses APB2 Peripheral Reset
 * @details Asserts and then releases the requested APB2 reset bits.
 * @param[in] mask	Raw hardware bit mask for APB2 peripheral reset pulse
 * @returns	@ref driver_status_t Status of APB2 reset pulse operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB2 reset pulsed successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_PulseAPB2Reset(const uint32_t mask);

/**
 * @brief	Pulses APB1 Peripheral Reset
 * @details Asserts and then releases the requested APB1 reset bits.
 * @param[in] mask	Raw hardware bit mask for APB1 peripheral reset pulse
 * @returns	@ref driver_status_t Status of APB1 reset pulse operation
 * @retval	`DRIVER_STATUS_SUCCESS`: APB1 reset pulsed successfully
 * @retval	`DRIVER_STATUS_ERROR_INVALID_ARG`: `mask` is invalid
 */
driver_status_t LL_RCC_PulseAPB1Reset(const uint32_t mask);

/** @} */ // RCC_02_LL_05_ClockReset

/** @} */ // RCC_02_LL

// C++ Compatibility
#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* RCC_LL_H_ */
